# task

## 1)load the dataset and display its shape,columns,and data types

In [132]:
import pandas as pd
df=pd.read_csv("C:\\Users\\prem2\\Downloads\\messy_employee_dataset_1000_rows.csv")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [133]:
df.shape

(1000, 9)

In [134]:
df.columns

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='object')

In [135]:
df.dtypes

user_id              object
age                  object
salary               object
department           object
join_date            object
city                 object
performance_score    object
experience_years     object
is_active            object
dtype: object

## 2)calculate the percentage of missing values for each column.

In [136]:
result=df.isnull().mean()*100
result

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

In [137]:
result1=df.isnull().sum()
for i in result1.index:
    print(f"{i}: {(result1[i]/1000)*100}% missing values")

user_id: 51.0% missing values
age: 11.4% missing values
salary: 31.1% missing values
department: 14.099999999999998% missing values
join_date: 21.9% missing values
city: 14.899999999999999% missing values
performance_score: 10.100000000000001% missing values
experience_years: 12.7% missing values
is_active: 20.0% missing values

## 3)identify columns containing mixed data types

In [138]:
df.apply(lambda col: col.map(type).nunique())

user_id              2
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

## 4)clean user_id by replacing empty strings with  nan and converting values to uppercase

In [139]:
import numpy as np
df["user_id"]=df["user_id"].replace("",np.nan).str.upper()
df["user_id"]

0        USER_0
1         U1001
2         U1002
3           NaN
4           NaN
         ...
995         NaN
996       U1996
997    USER_997
998       U1998
999         NaN
Name: user_id, Length: 1000, dtype: object

## 5)convert age to numeric and replace invalid values(negative or >100) with NaN.

In [140]:
df["age"]=pd.to_numeric(df["age"],errors="coerce")

In [141]:
df.loc[(df["age"]<0) | (df["age"]>100),"age"]=np.nan

In [142]:
df["age"]

0       NaN
1      30.0
2      30.0
3       NaN
4       NaN
       ...
995    60.0
996     NaN
997     NaN
998     NaN
999    30.0
Name: age, Length: 1000, dtype: float64

## 6)clean salary by removing currency symbols and converting it to numeric.

In [143]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,NaN,25000,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [144]:
df.dtypes

user_id               object
age                  float64
salary                object
department            object
join_date             object
city                  object
performance_score     object
experience_years      object
is_active             object
dtype: object

In [145]:
df["salary"]=df["salary"].astype(str).str.replace("₹","",regex=False).replace("N/A",np.nan)
df["salary"]=pd.to_numeric(df["salary"],errors="coerce")

In [146]:
df["salary"]

0       50000.00
1       45000.00
2       25000.00
3            NaN
4      120000.75
         ...
995     50000.00
996          NaN
997     25000.00
998     25000.00
999     45000.00
Name: salary, Length: 1000, dtype: float64

In [147]:
df["salary"].dtype

dtype('float64')

 ## 7)convert join_date into datetime format handling multiple date formats.

In [148]:
df["join_date"]=pd.to_datetime(df["join_date"],format="%m-%d-%y",errors="coerce",dayfirst=True)

## 8)extract joining year from the cleaned join date.

In [149]:
df["joining_year"]=df["join_date"].dt.year

## 9) standardize department values by trimming spaces and converting to uppercase.

In [150]:
df["department"]

0           HR
1      Finance
2           HR
3           HR
4           IT
        ...
995         HR
996         IT
997         HR
998        NaN
999         HR
Name: department, Length: 1000, dtype: object

In [151]:
df["department"]=df["department"].str.strip().str.upper()

In [152]:
df["department"]

0           HR
1      FINANCE
2           HR
3           HR
4           IT
        ...
995         HR
996         IT
997         HR
998        NaN
999         HR
Name: department, Length: 1000, dtype: object

## 10)normalize city names to a consistent case and spelling.

In [153]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,NaN,50000.00,HR,NaT,DELHI,3,five,True,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,3,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,excellent,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,DELHI,2,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,USER_997,NaN,25000.00,HR,NaT,Mumbai,3,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN

In [154]:
df["city"]=df["city"].str.strip().str.title()

In [155]:
df["city"]

0          Delhi
1          Delhi
2          Delhi
3      Hyderabad
4          Delhi
         ...
995        Delhi
996       Mumbai
997       Mumbai
998    Bangalore
999    Hyderabad
Name: city, Length: 1000, dtype: object

## 11)convert performance score into numeric by mapping text values to numbers.

In [156]:
df["performance_score"].unique()

array(['3', 'excellent', nan, '5', 'poor', '4', '1', '2'], dtype=object)

In [157]:
performance_map={'poor':0,'excellent':1}
df["performance_score"]=df["performance_score"].replace(performance_map)

In [158]:
df["performance_score"]

0        3
1        3
2        1
3        1
4      NaN
      ...
995      2
996    NaN
997      3
998      1
999      1
Name: performance_score, Length: 1000, dtype: object

In [159]:
df["performance_score"]=pd.to_numeric(df["performance_score"],errors='coerce')

## 12)clean experience_years by converting text values to numeric and removing negatives.

In [160]:
df["experience_years"].unique()

array(['five', '1', '10', '5', '-1', '0', nan, '3'], dtype=object)

In [161]:
m={'five':5}
df["experience_years"]=df["experience_years"].replace(m)

In [162]:
df["experience_years"]=pd.to_numeric(df["experience_years"],errors='coerce')

In [163]:
df.loc[df["experience_years"]<0,"experience_years"]=np.nan

In [164]:
df["experience_years"]

0       5.0
1       1.0
2      10.0
3       5.0
4       NaN
       ...
995     5.0
996     5.0
997     5.0
998     0.0
999     5.0
Name: experience_years, Length: 1000, dtype: float64

## 13)convert is_active values(yes/no/True/False) into boolean format.

In [166]:
df["is_active"]

0       True
1        yes
2      False
3        yes
4      False
       ...
995      NaN
996       no
997     True
998     True
999       no
Name: is_active, Length: 1000, dtype: object

In [167]:
df["is_active"].unique

<bound method Series.unique of 0       True
1        yes
2      False
3        yes
4      False
       ...
995      NaN
996       no
997     True
998     True
999       no
Name: is_active, Length: 1000, dtype: object>

In [172]:
m1={"yes":True,"no":False}
df["is_active"]=df["is_active"].replace(m1)

In [174]:
df["is_active"]=df["is_active"].astype("bool")
df["is_active"]

0       True
1       True
2       True
3       True
4       True
       ...
995     True
996    False
997     True
998     True
999    False
Name: is_active, Length: 1000, dtype: bool

## 14)identify and remove duplicate records based on user_id.

In [175]:
df=df.drop_duplicates(subset="user_id")

## 15)create a clean final DataFrame containing only valid ,standardized records.

In [176]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,NaN,50000.0,HR,NaT,Delhi,3.0,5.0,True,NaN
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,3.0,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,1.0,10.0,True,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,1.0,5.0,True,NaN
5,USER_5,NaN,25000.0,IT,NaT,NaN,3.0,0.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,NaN,NaN,SALES,NaT,Hyderabad,NaN,NaN,True,NaN
991,U1991,45.0,NaN,HR,NaT,Mumbai,NaN,NaN,True,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,False,NaN
997,USER_997,NaN,25000.0,HR,NaT,Mumbai,3.0,5.0,True,NaN
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,1.0,0.0,True,NaN

In [179]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 491 entries, 0 to 998
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            490 non-null    object
 1   age                254 non-null    float64
 2   salary             355 non-null    float64
 3   department         426 non-null    object
 4   join_date          0 non-null      datetime64[ns]
 5   city               422 non-null    object
 6   performance_score  441 non-null    float64
 7   experience_years   365 non-null    float64
 8   is_active          491 non-null    bool
 9   joining_year       0 non-null      float64
dtypes: bool(1), datetime64[ns](1), float64(5), object(3)
memory usage: 38.8+ KB

In [180]:
df.head()

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,NaN,50000.0,HR,NaT,Delhi,3.0,5.0,True,NaN
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,3.0,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,1.0,10.0,True,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,1.0,5.0,True,NaN
5,USER_5,NaN,25000.0,IT,NaT,NaN,3.0,0.0,False,NaN